# Table of contents

01. Importing libraries and customer dataset and preliminary first steps
02. Exploring customer data
03. Customer data consistency checks
- Changing column names and data types
04. Merging customer dataset with prods_ords dataset
05. Exporting dataset

# 01. Importing libraries and customer dataset and preliminary first steps

In [1]:
#Importing libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
# Importing new customer dataset

customers = pd.read_csv(r'/Users/zoey/Career Foundry Stuff/Instacart Basket Analysis - 14.12.2023/02 Data/Original Data/customers.csv')

In [3]:
customers.shape

(206209, 10)

In [4]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [6]:
# Dropping first name and last name columns for privacy reasons and because user_id covers this same information

customers = customers.drop(columns = ['First Name', 'Surnam'])

In [7]:
customers.shape

(206209, 8)

In [8]:
customers.head(15)

,user_id,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Female,Maryland,26,1/1/2017,1,married,40374
5,133128,Female,Kentucky,43,1/1/2017,2,married,49643
6,152052,Male,Montana,20,1/1/2017,0,single,61746
7,168851,Male,South Carolina,30,1/1/2017,0,single,63712
8,69965,Male,Texas,47,1/1/2017,1,married,162432
9,82820,Male,Virginia,26,1/1/2017,2,married,32072
10,26441,Female,Nevada,19,1/1/2017,2,living with parents and siblings,43443
11,33835,Male,Nebraska,45,1/1/2017,2,married,47988
12,75032,Female,Georgia,75,1/1/2017,1,married,57835
13,51,Female,Wyoming,37,1/1/2017,1,married,71190
14,516,Male,Colorado,51,1/1/2017,2,married,146559

# 02. Exploring the data

In [9]:
# Looking at the user_id in more depth

customers['user_id'].value_counts(dropna = False)

user_id
26711     1
67322     1
173044    1
61044     1
98344     1
         ..
146847    1
154991    1
172193    1
184326    1
80148     1
Name: count, Length: 206209, dtype: int64

In [10]:
# Looking at the gender column in more depth

customers['Gender'].value_counts(dropna = False)

Gender
Male      104067
Female    102142
Name: count, dtype: int64

In [11]:
# Looking at the state column in more depth

customers['STATE'].value_counts(dropna = False)

STATE
Florida                 4044
Colorado                4044
Illinois                4044
Alabama                 4044
District of Columbia    4044
Hawaii                  4044
Arizona                 4044
Connecticut             4044
California              4044
Indiana                 4044
Arkansas                4044
Alaska                  4044
Delaware                4044
Iowa                    4044
Idaho                   4044
Georgia                 4044
Wyoming                 4043
Mississippi             4043
Oklahoma                4043
Utah                    4043
New Hampshire           4043
Kentucky                4043
Maryland                4043
Rhode Island            4043
Massachusetts           4043
Michigan                4043
New Jersey              4043
Kansas                  4043
South Dakota            4043
Minnesota               4043
Tennessee               4043
New York                4043
Washington              4043
Louisiana               4043
Montana                 4043
North Dakota            4043
Wisconsin               4043
Nebraska                4043
Vermont                 4043
Nevada                  4043
Maine                   4043
North Carolina          4043
West Virginia           4043
Virginia                4043
Oregon                  4043
New Mexico              4043
Texas                   4043
Pennsylvania            4043
Ohio                    4043
South Carolina          4043
Missouri                4043
Name: count, dtype: int64

In [12]:
# Looking at the age column in more depth

customers['Age'].value_counts(dropna = False)

Age
19    3329
55    3317
51    3317
56    3306
32    3305
      ...
65    3145
25    3127
66    3114
50    3102
36    3101
Name: count, Length: 64, dtype: int64

In [13]:
# Looking at the date joined column in more depth

customers['date_joined'].value_counts(dropna = False)

date_joined
9/17/2018     213
2/10/2018     212
4/1/2019      211
9/21/2019     211
12/19/2017    210
             ...
9/1/2018      141
1/22/2018     140
11/24/2017    139
7/18/2019     138
8/6/2018      128
Name: count, Length: 1187, dtype: int64

In [14]:
# Looking at the number of dependents column in more depth

customers['n_dependants'].value_counts(dropna = False)

n_dependants
0    51602
3    51594
1    51531
2    51482
Name: count, dtype: int64

In [15]:
# Looking at the family status column in more depth

customers['fam_status'].value_counts(dropna = False)

fam_status
married                             144906
single                               33962
divorced/widowed                     17640
living with parents and siblings      9701
Name: count, dtype: int64

In [16]:
# Looking at the income column in more depth

customers['income'].value_counts(dropna = False)

income
57192     10
95891     10
95710     10
97532      9
98675      9
          ..
73141      1
71524      1
74408      1
44780      1
148828     1
Name: count, Length: 108012, dtype: int64

In [17]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 8 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   Gender        206209 non-null  object
 2   STATE         206209 non-null  object
 3   Age           206209 non-null  int64
 4   date_joined   206209 non-null  object
 5   n_dependants  206209 non-null  int64
 6   fam_status    206209 non-null  object
 7   income        206209 non-null  int64
dtypes: int64(4), object(4)
memory usage: 12.6+ MB

# 03. Customer data consistency checks
- Changing column names and data types

In [18]:
# Changing column names so that they are all lower case and spelled correctly

customers.rename(columns={'Gender':'gender', 'STATE':'state', 'Age':'age', 'n_dependants':'dependents'}, inplace=True)

In [19]:
customers.head()

   user_id  gender       state  age date_joined  dependents fam_status  income
0    26711  Female    Missouri   48    1/1/2017           3    married  165665
1    33890  Female  New Mexico   36    1/1/2017           0     single   59285
2    65803    Male       Idaho   35    1/1/2017           2    married   99568
3   125935  Female        Iowa   40    1/1/2017           0     single   42049
4   130797  Female    Maryland   26    1/1/2017           1    married   40374

In [20]:
# Changing user_id data type to string because it should be treated as such and not included in numeric calculations

customers['user_id'] = customers['user_id'].astype('str')

In [21]:
customers.describe()

                 age     dependents         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [22]:
# Checking data for columns that have mixed-type data

for col in customers.columns.tolist():
    weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
    
    if len (customers[weird]) > 0:
        print (col)

Notes: Since the above code did not return any results, there are no columns with mixed-type data that need to be further addressed.

In [23]:
# Checking what other datatypes the other columns are

customers.dtypes

user_id        object
gender         object
state          object
age             int64
date_joined    object
dependents      int64
fam_status     object
income          int64
dtype: object

In [24]:
# Checking for missing values

customers.isnull().sum()

user_id        0
gender         0
state          0
age            0
date_joined    0
dependents     0
fam_status     0
income         0
dtype: int64

Notes: Since there are no missing values, as per the output above, no further actions required here.

In [25]:
# Double-checking for columns with missing values

customers.columns[customers.isnull().any()]

Index([], dtype='object')

In [26]:
# Checking for duplicate values

dups_customers = customers[customers.duplicated()]

In [27]:
dups_customers.shape

(0, 8)

Notes: Based on the above outputs, there are no duplicates in the dataset.

In [28]:
customers.shape

(206209, 8)

# 04. Merging customer dataset with prods_ords dataset

In [29]:
# Importing previously wrangled and flagged producst and orders dataset

ords_prods_flag = pd.read_pickle(r'/Users/zoey/Career Foundry Stuff/Instacart Basket Analysis - 14.12.2023/02 Data/Prepared Data/ords_prods_merged_flagged.pkl')

In [30]:
ords_prods_flag.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,av_price_order,spending_flag,order_regularity,order_frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Mid-range product,Regularly busy,Regularly busy,Most orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Mid-range product,Regularly busy,Regularly busy,Average orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Mid-range product,Busiest day,Busiest days,Average orders,5,New customer,7.930208,Low spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Mid-range product,Regularly busy,Least busy days,Most orders,3,New customer,4.972414,Low spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Mid-range product,Least busy,Least busy days,Average orders,3,New customer,4.972414,Low spender,9.0,Frequent customer

In [31]:
# Get a list of all column names
column_names = ords_prods_flag.columns.tolist()

# Print the list of column names
print(column_names)

['product_id', 'product_name', 'aisle_id', 'department_id', 'prices', 'order_id', 'user_id', 'order_number', 'orders_day_of_week', 'order_hour_of_day', 'days_since_last_order', 'add_to_cart_order', 'reordered', '_merge', 'price_range_loc', 'busiest_day', 'busiest_days', 'busiest_period_of_day', 'max_order', 'loyalty_flag', 'av_price_order', 'spending_flag', 'order_regularity', 'order_frequency_flag']

In [32]:
# Dropping "_merge" column

ords_prods_flag.drop(columns=['_merge'], inplace=True)

In [33]:
# Checking that the drop was successful

# Getting a list of all column names
column_names = ords_prods_flag.columns.tolist()

# Printing the list of column names
print(column_names)

['product_id', 'product_name', 'aisle_id', 'department_id', 'prices', 'order_id', 'user_id', 'order_number', 'orders_day_of_week', 'order_hour_of_day', 'days_since_last_order', 'add_to_cart_order', 'reordered', 'price_range_loc', 'busiest_day', 'busiest_days', 'busiest_period_of_day', 'max_order', 'loyalty_flag', 'av_price_order', 'spending_flag', 'order_regularity', 'order_frequency_flag']

In [34]:
ords_prods_flag.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,price_range_loc,busiest_day,busiest_days,busiest_period_of_day,max_order,loyalty_flag,av_price_order,spending_flag,order_regularity,order_frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Mid-range product,Regularly busy,Regularly busy,Most orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Mid-range product,Regularly busy,Regularly busy,Average orders,32,Regular customer,6.935811,Low spender,8.0,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Mid-range product,Busiest day,Busiest days,Average orders,5,New customer,7.930208,Low spender,8.0,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Mid-range product,Regularly busy,Least busy days,Most orders,3,New customer,4.972414,Low spender,9.0,Frequent customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Mid-range product,Least busy,Least busy days,Average orders,3,New customer,4.972414,Low spender,9.0,Frequent customer

In [35]:
# Checking data type of user_id column

ords_prods_flag.dtypes

product_id                 int64
product_name              object
aisle_id                   int64
department_id              int64
prices                   float64
order_id                   int64
user_id                    int64
order_number               int64
orders_day_of_week         int64
order_hour_of_day          int64
days_since_last_order    float64
add_to_cart_order          int64
reordered                  int64
price_range_loc           object
busiest_day               object
busiest_days              object
busiest_period_of_day     object
max_order                  int64
loyalty_flag              object
av_price_order           float64
spending_flag             object
order_regularity         float64
order_frequency_flag      object
dtype: object

In [36]:
# Changing user_id data type to string so that it matches in the upcoming merge

ords_prods_flag['user_id'] = ords_prods_flag['user_id'].astype('str')

In [37]:
# Checking data types again to confirm

ords_prods_flag.dtypes

product_id                 int64
product_name              object
aisle_id                   int64
department_id              int64
prices                   float64
order_id                   int64
user_id                   object
order_number               int64
orders_day_of_week         int64
order_hour_of_day          int64
days_since_last_order    float64
add_to_cart_order          int64
reordered                  int64
price_range_loc           object
busiest_day               object
busiest_days              object
busiest_period_of_day     object
max_order                  int64
loyalty_flag              object
av_price_order           float64
spending_flag             object
order_regularity         float64
order_frequency_flag      object
dtype: object

In [38]:
# Merging the customers dataset with the ords_prods_flag using the user_id column

ords_prods_customers = ords_prods_flag.merge(customers, on=['user_id'], indicator=True)

In [39]:
# Checking the merge

ords_prods_customers['_merge'].value_counts(dropna=False)

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [40]:
ords_prods_customers.shape

(32404859, 31)

In [41]:
# Dropping merge column again from newly merged set

ords_prods_customers.drop(columns=['_merge'], inplace=True)

In [42]:
ords_prods_customers.shape

(32404859, 30)

# 05. Exporting orders-products-customer dataset

In [43]:
ords_prods_customers.to_pickle(r'/Users/zoey/Career Foundry Stuff/Instacart Basket Analysis - 14.12.2023/02 Data/Prepared Data/ords_prods_customers.pkl')